"""
จากตัวเลข 13 หลัก ในบัตรประชาชน จงหาค่า Key ซึ่งเป็นตัวเลขสี่หลัก ด้วยวิธีการดังนี้

หาผลรวมของตัวเลขทั้ง 13 หลัก
เอาค่า 3 หลักสุดท้าย คูณด้วย 10
เอาค่าจากข้อ 1) และ 2) มาบวกกัน จะได้เป็น Key ถ้าหากได้ค่ามากกว่าสี่หลักให้ตัดเอาแค่สี่หลักสุดท้าย
แต่ถ้าค่าน้อยกว่า 1,000 ให้บวก เพิ่ม 1,000 ก็จะได้เลขสี่หลัก ซึ่งเป็น Key

input  Specification
1 บรรทัด
บรรทัดที่ 1 : เลขประจำตัวประชาชน 13 หลัก

output Specification
1 บรรทัด

บรรทัดที่ 1 : ค่า Key ของเลขบัตรประจำตัวประชาชนออกมา
"""
# 13 digit
n = input()
sum = 0
for i in n:
    sum += int(i)
key = sum % 1000
key += int
if key < 1000:
    key += 1000
print(key)
